#以下操作在1366X168分辨率有效
$win1 = 打开通达信[D:\Program Files (x86)\new_tdx\TdxW.exe] max
等待3秒
点击[816,413]   #点击”免费选择“
点击[922,446]   #点击”登陆按钮“
等待15秒
点击[41,11]   #点击”系统菜单“
等待2秒
点击[79,77]   #点击”导出菜单“
等待2秒
点击[856,279]   #点击”高级导出按钮“
等待2秒
点击[559,450]   #点击”复权方式“
等待1秒
点击[501,480]   #点击”前复权“
等待1秒
点击[555,495]   #点击”分割方式“
等待1秒
点击[492,509]   #点击”逗号分割“
等待1秒
点击[805,500]   #点击”添加品种“
等待2秒
点击[373,283]   #点击”沪深A股“
等待2秒
点击[856,597]   #点击”全选“
等待2秒
点击[930,599]   #点击”确定“
等待2秒
点击[807,534]   #点击”开始导出“
等待2秒
点击[805,433]   #点击”确定“
等待2分钟
点击[764,421]   #点击”确定“
点击[890,533]   #点击”关闭“
关闭$win1

合并日线






